# ubuntu gnu linux 的gnome桌面的有趣又有用的小程序

## gnome桌面的小程序(applet)

右键点击ubntun gun/linux的面板，选择添加到面板，会有很多小程序让你添加。我非常喜欢

###小鱼（就是fortune的一个前端吧），

点一下小鱼他就会显示几句话，基本都是很有去的，有莎士比亚的名言到各种有趣的话。都是英文的。我认为中文自由软件社区也可以提供一套中文的fortune。

感觉国外的中餐馆吃完饭后上点心都有fortune cookies，就像是那种算命和皇历的话。

我现在怎么也想不出这个fortune对应的中文是什么了？

还有，小鱼显示的默认字体太小了。我没找到如何调整大一些。我眼镜很不好，还请帮忙。

你在命令行下直接用fortune命令也可以看到小鱼说什么：）

这个小鱼程序的介绍是这样的。wanda是小鱼的名字

>Wanda 其实什么用处都没有。它只会占硬盘空间、编译时间，运行时还得占去您宝贵的面板和内存空间。如果发现任何人在使用这个小程序，他可能应该马上送去检查一下精神状况喔


### 阿贴便（）。

阿贴便（），最后那个字我不会念。所以无法用拼音输入出来。谁知道请告诉我。

这个东西应该就是tomboy postit这个程序。好处是你要随时记录什么，点一下很方便。所以的小纸条都可以很快找到，还能搜索。

不好的地方是***无法选择多行***。你要删除一段只能一个字一个字删除，虽然也快，但我还是觉得慢。

当然人家本来的用法是记录一下给谁回电话，下班购物清单等这些没几行的东西，像我这样整篇文章在里面写的本来就不是人家的用户群。

这个小postit还能帮你写和导出html文件，甚至支持wikiwords。不过这些我都不用。而且我希望禁止他的wiki语法，和我常用的markdown有冲突。我不想让它解释。没研究怎么弄。谁知道说说。


下面的警告解除。不过我当时确实遇到了描述的情况。但现在不出现了。可能是[和scim有关的冲突](http://pengyou.rijiben.org/node/1664)而不是tomboy的问题。 --  警告：不要用这个写blog文章，像我刚才一样，一写写了5 6篇，才发现不能全选复制文本出来！！！！还好我从首选项中同步我写的便条到一个文件夹，那个文件夹是便条的html版本。从那里可以复制出来。真可惜，多好的工具啊。我本来想用他来快速写文章呢。


### 天气预报

因为我ubuntu gnu/linux选择时区是北京时间的原因，加入到面板直接就显示北京当天的天气预报。点它可显示详细天气包括湿度 气压 能见度 日出日落时间等。如果想换成其他城市，右键点并选首选项，点上面的位置，选择城市，内地城市不多，不到20个。只有大城市的。这个应该跟某个国家和地区是否在网上提供天气预报服务，服务是否方便集成到这个小程序有关。

## 问题

1 你们喜欢用的小applet有什么。
2 是不是还可以去网上下更多的小程序。gnome默认让我选的有30个左右，但是还是不如google gadget多。
3 我前文有几个问题你们谁能帮我一下。
